In [87]:
#  引入pandas 
#  Series可以看做是一纬数据结构，DataFrame可以看做是多维数据结构
#  如果读取一个多行CSV，那么默认应该就是DataFrame,如果从中拿出一行或一列来，那就是Series
from pandas import Series , DataFrame
import pandas as pd

In [88]:
# 从csv中读取数据，如果不设置的化，默认是用逗号分割的,header=0标识头在第1行上，如果没有头可以设置为-1
df=pd.read_csv('data\\test.csv',header=0)
df

    a         b        c   d   e   f
0  a1  zhangsan  1980/07  34  35  76
1  a2    wangwu  1980/03  23  45  63
2  a3      lisi  1981/12  90  54  42
3  a4    wangsi  1981/03  66  73  33

In [89]:
# 重命名列，但必须所有列都重命名,如何只改某一个还需要测试
df.columns=['id','name','bir','age','socket','num']
df

   id      name      bir  age  socket  num
0  a1  zhangsan  1980/07   34      35   76
1  a2    wangwu  1980/03   23      45   63
2  a3      lisi  1981/12   90      54   42
3  a4    wangsi  1981/03   66      73   33

In [90]:
# 读取前两行
df.head(2)

   id      name      bir  age  socket  num
0  a1  zhangsan  1980/07   34      35   76
1  a2    wangwu  1980/03   23      45   63

In [91]:
# 读取后两行
df.tail(2)

   id    name      bir  age  socket  num
2  a3    lisi  1981/12   90      54   42
3  a4  wangsi  1981/03   66      73   33

In [92]:
len(df)

4

In [93]:
# 设置显示三位数
pd.options.display.float_format='{:,.3f}'.format

# 获取数量cout，平均值mean，方差std 最小值min 最大值 max
df.describe()

         age  socket    num
count  4.000   4.000  4.000
mean  53.250  51.750 53.500
std   30.544  16.153 19.570
min   23.000  35.000 33.000
25%   31.250  42.500 39.750
50%   50.000  49.500 52.500
75%   72.000  58.750 66.250
max   90.000  73.000 76.000

In [94]:
# 获取一列数据，以下两种方式是等价,如果列名没有特殊字符的话，可以直接象属性一样使用
# 注意获取的列也是纵向排列的
df['age']
df.age

0    34
1    23
2    90
3    66
Name: age, dtype: int64

In [107]:
# df记录过滤,条件需要用（）包起来
print(df[(df['age']>30)&(df['age']<80)])
print('*********************************')
print(df[(df['age']<30)|(df['age']>80)])

          id      bir  age  socket  num
name
zhangsan  a1  1980/07   34      35   76
wangsi    a4  1981/03   66      73   33
*********************************
        id      bir  age  socket  num
name
wangwu  a2  1980/03   23      45   63
lisi    a3  1981/12   90      54   42

In [96]:
# df记录字符串过滤，必须使用.str.[string method]，不能在属性上直接操作
df[df['name'].str.startswith('wang')]

   id    name      bir  age  socket  num
1  a2  wangwu  1980/03   23      45   63
3  a4  wangsi  1981/03   66      73   33

In [97]:
# 获取行数据和某个列上的值,下标是从0开始的
print(len(df.iloc[2]))
print(df.iloc[2]['name'])

6
lisi

In [98]:
# 设置一个列做为行索引，也就是key.
# 如果将这个列设置为行索引了，则不能够从再以列的方式获取到它了
df=df.set_index(['name'])
df

          id      bir  age  socket  num
name
zhangsan  a1  1980/07   34      35   76
wangwu    a2  1980/03   23      45   63
lisi      a3  1981/12   90      54   42
wangsi    a4  1981/03   66      73   33